# GetWallRecessGroup

## Description
Get the wall recess geometry group associated with the object.

```pascal
FUNCTION GetWallRecessGroup(objectHand : HANDLE): HANDLE;
```

```python
def vs.GetWallRecessGroup(objectHand):
    return HANDLE
```

## Parameters
|Name|Type|Description|
|---|---|---|
|objectHand|HANDLE|Object handle to get the geometry for.|

## Version
Availability: from Vectorworks 2020

## Category
* Objects - Custom